app/Controllers/Home.php

SELECT *
FROM `users`
---
    public function list()
    {
        $data = [
            'users' => (new UserModel())->findAll()
        ];

INSERT INTO `users` (`name`, `email`, `phone`) VALUES ('Data Ketiga', 'dataketiga@gmail.com', '333321324234')
---
    public function pressTambah()
    {
        $users = new UserModel();

        $name = $this->request->getPost('name');
        $email = $this->request->getPost('email');
        $phone = $this->request->getPost('phone');

        $users->insert([
            'name' => $name,
            'email' => $email,
            'phone' => $phone
        ]);

SELECT *
FROM `users`
WHERE `users`.`id` = '2'
---
    public function ubah($id)
    {
        $users = new UserModel();
        $data = [
            'user' => $users->find($id)
        ];